<a href="https://colab.research.google.com/github/isha11-by/AI-project/blob/main/Untitled558_(1).ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
import pandas as pd

In [ ]:
df=pd.read_csv("D:/Datasets/hourly_changes.csv")

In [ ]:
df

,wage_per_hour,union,education_yrs,experience_yrs,age,female,marr,south,manufacturing,construction
0,5.10,0,8,21,35,1,1,0,1,0
1,4.95,0,9,42,57,1,1,0,1,0
2,6.67,0,12,1,19,0,0,0,1,0
3,4.00,0,12,4,22,0,0,0,0,0
4,7.50,0,12,17,35,0,1,0,0,0
...,...,...,...,...,...,...,...,...,...,...
529,11.36,0,18,5,29,0,0,0,0,0
530,6.10,0,12,33,51,1,1,0,0,0
531,23.25,1,17,25,48,1,1,0,0,0
532,19.88,1,12,13,31,0,1,1,0,0
533,15.38,0,16,33,55,0,1,0,1,0

In [ ]:
y=df["wage_per_hour"]

In [ ]:
X=df.drop("wage_per_hour",axis="columns")

In [ ]:
X

,union,education_yrs,experience_yrs,age,female,marr,south,manufacturing,construction
0,0,8,21,35,1,1,0,1,0
1,0,9,42,57,1,1,0,1,0
2,0,12,1,19,0,0,0,1,0
3,0,12,4,22,0,0,0,0,0
4,0,12,17,35,0,1,0,0,0
...,...,...,...,...,...,...,...,...,...
529,0,18,5,29,0,0,0,0,0
530,0,12,33,51,1,1,0,0,0
531,1,17,25,48,1,1,0,0,0
532,1,12,13,31,0,1,1,0,0
533,0,16,33,55,0,1,0,1,0

# Step 1: Specify the architecture

In [ ]:
import keras
from keras.models import Sequential
from keras.layers import Dense

In [ ]:
model=Sequential()
model.add(Dense(64,activation="relu",input_shape=(9,)))
model.add(Dense(32,activation="relu"))
model.add(Dense(1))

# Step 2: compile the model

In [ ]:
model.compile(optimizer="adam",loss="mean_squared_error")

# Step 3: fitting the model

In [ ]:
model.fit(X,y,epochs=10)

Epoch 1/10
17/17 [==============================] - 0s 763us/step - loss: 28.9231
Epoch 2/10
17/17 [==============================] - 0s 806us/step - loss: 23.1024
Epoch 3/10
17/17 [==============================] - 0s 880us/step - loss: 22.4373
Epoch 4/10
17/17 [==============================] - 0s 2ms/step - loss: 22.3934
Epoch 5/10
17/17 [==============================] - 0s 607us/step - loss: 22.3733
Epoch 6/10
17/17 [==============================] - 0s 411us/step - loss: 21.1499
Epoch 7/10
17/17 [==============================] - 0s 645us/step - loss: 21.2036
Epoch 8/10
17/17 [==============================] - 0s 2ms/step - loss: 21.8849
Epoch 9/10
17/17 [==============================] - 0s 704us/step - loss: 20.6934
Epoch 10/10
17/17 [==============================] - 0s 411us/step - loss: 20.7815

# Step 4: predict using the model

In [ ]:
X

,union,education_yrs,experience_yrs,age,female,marr,south,manufacturing,construction
0,0,8,21,35,1,1,0,1,0
1,0,9,42,57,1,1,0,1,0
2,0,12,1,19,0,0,0,1,0
3,0,12,4,22,0,0,0,0,0
4,0,12,17,35,0,1,0,0,0
...,...,...,...,...,...,...,...,...,...
529,0,18,5,29,0,0,0,0,0
530,0,12,33,51,1,1,0,0,0
531,1,17,25,48,1,1,0,0,0
532,1,12,13,31,0,1,1,0,0
533,0,16,33,55,0,1,0,1,0

In [ ]:
data=pd.DataFrame({"union":[0],"education_yrs":[15],"experience_yrs":[0],
             "age":[21],"female":[0],"marr":[0],"south":[0],
             "manufacturing":[0],"construction":[0]})

In [ ]:
data

,union,education_yrs,experience_yrs,age,female,marr,south,manufacturing,construction
0,0,15,0,21,0,0,0,0,0

In [ ]:
data.shape

(1, 9)

In [ ]:
X.shape

(534, 9)

In [ ]:
model.predict(data)

array([[7.53325]], dtype=float32)